
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ++ Антонцев: Добавление поля скидки и кнопки для пересчета на форму | 20.09.2026
	ГруппаСкидка = Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидка.Заголовок = "Группа скидка";
	ГруппаСкидка.ОтображатьЗаголовок = Ложь;
	ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВводаСкидка = Элементы.Добавить("ДорКонф_СогласованнаяСкидка", Тип("ПолеФормы"), Элементы.ГруппаСкидка);
	ПолеВводаСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаСкидка.ПутьКДанным = "Объект.ДорКонф_СогласованнаяСкидка";
	ПолеВводаСкидка.УстановитьДействие("ПриИзменении", "ДорКонф_СогласованнаяСкидкаПриИзменении");
	
	Команда = Команды.Добавить("ПересчитатьСкидку");
	Команда.Заголовок = "Пересчитать скидку";
	Команда.Действие = "ДорКонф_ПересчитатьСкидку";
	
	КнопкаКоманды = Элементы.Добавить("КнопкаПересчитатьСкидку", Тип("КнопкаФормы"), Элементы.ГруппаСкидка);
	КнопкаКоманды.ИмяКоманды = "ПересчитатьСкидку";
	КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	// -- Антонцев
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ДорКонф_СогласованнаяСкидкаПриИзменении(Элемент)
	// ++ Антонцев: _____ | 20.09.2026
	Если Не (Элементы.Товары.ТекущиеДанные = Неопределено 
		И Элементы.Услуги.ТекущиеДанные = Неопределено) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ДорКонф_ПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Пересчитать табличную часть с учетом новой скидки?",
			РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
		
	КонецЕсли;
	// -- Антонцев
КонецПроцедуры

&НаКлиенте
Процедура ДорКонф_ПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	// ++ Антонцев: _____ | 20.09.2026
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДорКонф_ПересчетСкидки();
	КонецЕсли;
	// -- Антонцев
КонецПроцедуры

&НаКлиенте
Процедура ДорКонф_ПересчитатьСкидку(Команда)
	// ++ Антонцев: _____ | 20.09.2026
	ДорКонф_ПересчетСкидки();
	// -- Антонцев
КонецПроцедуры

&НаКлиенте
Процедура ДорКонф_ПересчетСкидки()
	// ++ Антонцев: _____ | 20.09.2026
	Для Каждого Строка Из Объект.Товары Цикл
		РассчитатьСуммуСтроки(Строка);
	КонецЦикла;	
	
	Для Каждого Строка Из Объект.Услуги Цикл		
		РассчитатьСуммуСтроки(Строка);
	КонецЦикла;	
	// -- Антонцев
КонецПроцедуры	


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// ++ Антонцев: добавление в расчет скидки | 20.09.2026
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100 - Объект.ДорКонф_СогласованнаяСкидка / 100;
	
	Если КоэффициентСкидки < 0 Тогда
		ТекущиеДанные.Сумма = 0;
	Иначе
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	КонецЕсли;	
	
	// -- Антонцев	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

